ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/HSM/f29h85x_hsm_dthe_crc_s_regs.xml
<module id="HSM_DTHE_CRC_S" HW_revision="" description="HSM DTHE CRC S Registers">
	<register id="S_CRC_CTRL" width="32" page="0" offset="0" internal="0" description="">
		<bitfield id="TYPE" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="ENDIAN" description="" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="RES1" description="" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="IBR" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="OBR" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="OINV" description="" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="RES2" description="" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="BYTE" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INIT" description="" begin="14" end="13" width="2" rwaccess="RW"/>
		<bitfield id="FLASH_ACC2CRC" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="RES3" description="" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="S_CRC_SEED" width="32" page="0" offset="32" internal="0" description="">
		<bitfield id="SEED" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_CRC_DIN" width="32" page="0" offset="64" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_CRC_RSLT_PP" width="32" page="0" offset="96" internal="0" description="">
		<bitfield id="RSLT_PP" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
